app/Http/Controllers/ArtikelController.php

    public function index()
    {
        // mengambil semua data artikel
        // Eloquent ORM
        // SELECT * FROM artikel
        $artikel = Artikel::all();
---
select * from `artikel`

    public function store(Request $request)
    {
        // move thumbnail ke folder public/thumbnail
        $request->file('thumbnail')->move('thumbnail', $request->file('thumbnail')->getClientOriginalName());

        // slug
        $slug = Str::of($request->judul)->slug('-');

        // simpan data ke dalam tabel artikel
        Artikel::create([
            'judul'     => $request->judul,
            'tanggal'   => $request->tanggal,
            'thumbnail' => $request->file('thumbnail')->getClientOriginalName(),
            'slug'      => $slug,
            'isi'       => $request->isi,
        ]);
---
insert into `artikel` (`judul`, `tanggal`, `thumbnail`, `slug`, `isi`, `updated_at`, `created_at`) values ('Fitur terbaru laravel 9', '2023-10-20', 'default.png', '<p>sample</p>', '<p>sample</p>', '2023-10-20 12:20:23', '2023-10-20 12:20:23')