app/Http/Controllers/DashboardController.php

select * from `artikel`
---
    public function create()
    {
        $artikel = Artikel::all();