app/Http/Controllers/DashboardController.php

select * from `artikel`
select `judul`, `isi` from `artikel`
---
    public function create()
    {
        // mengambil semua data dari tabel artikel
        // select * from artikel
        // Eloquent ORM
        $artikel = Artikel::all();

        Artikel::select('judul', 'isi')->get();