app/Http/Controllers/HomeController.php

    public function index()
    {
        // ambil semua data artikel
        // select * from artikel
        // eloquent: ORM (Object Relational Mapping)
        $artikel = Artikel::all();
---
select * from `artikel`

    public function show(string $id)
    {
        // cari data dengan slug yang sesuai
        // select * from artikel where slug = $id limit 1
        $artikel = Artikel::where('slug', $id)->first();
---
select * from `artikel` where `slug` = 'satu-ruas-kelar-awal-2024-nih-kabar-terbaru-proyek-tol-yogya-bawen' limit 1