app/Http/Controllers/Admin/ArtikelController.php

select * from `artikel`
---
    public function index()
    {
        // mengambil semua data artikel
        $artikel = Artikel::all();

insert into `artikel` (`judul`, `tanggal`, `thumbnail`, `slug`, `isi`, `updated_at`, `created_at`) values ('Satu Ruas Kelar Awal 2024, Nih Kabar Terbaru Proyek Tol Yogya-Bawen', '2023-11-03', 'AA1fqv4R.jpeg', '\"satu-ruas-kelar-awal-2024-nih-kabar-terbaru-proyek-tol-yogya-bawen\"', '<p><strong>KOMPAS.com</strong> - Jalan Tol Yogyakarta-Bawen yang merupakan bagian Proyek Strategis Nasional (PSN) kini sedang dalam penyelesaian konstruksi khususnya pada Seksi 1 JC Sleman-SS Banyurejo.</p><p>Dikutip dari laman Badan Pengatur Jalan Tol (BPJT) pada Kamis (02/11/2023), terkait bangunan Cagar Budaya Padukuhan Pundong 2 Kalurahan Tirtoadi yang terdampak proyek, saat ini telah dilakukan survey dan review Rincian Anggaran Biaya (RAB) untuk Relokasi Cagar Budaya oleh Dinas Kebudayaan Daerah Istimewa Yogyakarta.</p><p>Saat ini progres konstruksi Seksi 1 sepanjang 8,8 Km telah mencapai 59,93% dan ditargetkan rampung pada Kuartal Pertama Tahun 2024 mendatang.</p><p>Kemudian untuk konstruksi Seksi 6 Ambarawa-Bawen yang sudah dimulai pelaksanaannya, PT Jasamarga Jogja Bawen (JJB) sudah berkordinasi dengan Bupati Semarang terkait Izin memulai konstruksi di wilayah semarang.</p><p>Di mana saat ini sedang dilakukan pekerjaan pembersihan lokasi kerja, timbunan tanah, dan borpile.</p>', '2023-11-03 12:13:51', '2023-11-03 12:13:51')
---
    public function store(Request $request)
    {
        // move thumbnail ke folder public/thumbnail
        $request->thumbnail->move(public_path('thumbnail'), $request->thumbnail->getClientOriginalName());

        // slug
        $slug = Str::of($request->judul)->slug('-');

        // simpan ke database
        Artikel::create([
            'judul'         => $request->judul,
            'tanggal'       => $request->tanggal,
            'thumbnail'     => $request->thumbnail->getClientOriginalName(),
            'slug'          => $slug,
            'isi'           => $request->isi,
        ]);

select * from `artikel` where `artikel`.`id` = '2' limit 1
---
    public function edit(string $id)
    {
        // mengambil data artikel berdasarkan id
        $artikel = Artikel::find($id);

delete from `artikel` where `id` = 1
---
    public function destroy(string $id)
    {
        // menghapus artikel berdasarkan id
        Artikel::destroy($id);