app/Http/Controllers/Admin/ArtikelController.php

    public function index()
    {
        // mengambil semua data artikel
        // Eloquent => ORM (Object Relational Mapping)
        // select * from artikel
        $artikel = Artikel::all();

        Artikel::select('judul', 'tanggal')->get();
---
select `judul`, `tanggal` from `artikel`